Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/xc32/ATSAMRH707F18A/startup_atsamrh707f18a.c
/**
 * \file
 *
 * \brief MPLAB(R) XC32 - Startup code for SAMRH707F18A
 *
 * Copyright (c) 2023 Microchip Technology Inc.
 *
 * \license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \license_stop
 *
 */

#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#if __XC32_VERSION__ >= 2300
#pragma nocodecov
#endif


#ifndef   __INLINE
#if __GNUC_GNU_INLINE__ == 1
  #define __INLINE              __inline__
#else
  #define __INLINE              inline
#endif
#endif

#ifndef   __STATIC_INLINE
  #define __STATIC_INLINE       static __INLINE
#endif

#ifndef   __STATIC_FORCEINLINE
  #define __STATIC_FORCEINLINE  __attribute__((always_inline)) static __INLINE
#endif

#include <xc.h>
#include <libpic32c.h>

#ifndef __always_inline
#define __always_inline	__attribute__((__always_inline__))
#endif

/*
 *  Define the __XC32_RESET_HANDLER_NAME macro on the command line when you
 *  want to use a different name for the Reset Handler function.
 */
#ifndef __XC32_RESET_HANDLER_NAME
#define __XC32_RESET_HANDLER_NAME Reset_Handler
#endif /* __XC32_RESET_HANDLER_NAME */

/*
 *  The MPLAB X Simulator does not yet support simulation of programming the 
 *  GPNVM bits yet. We can remove this once it supports the FRDY bit.
 */
#ifdef __MPLAB_DEBUGGER_SIMULATOR
#define __XC32_SKIP_STARTUP_GPNVM_WAIT
#endif

/*
 *  This startup code relies on features that are specific to the MPLAB XC32
 *  toolchain. Do not use it with other toolchains.
 */
#ifndef __XC32
#warning This startup code is intended for use with the MPLAB XC32 Compiler only.
#endif


/*
 * RH71 devices have a "hardened" embedded flash controller that use
 * HEFC as the prefix on the module name instead of EEFC.  Use some
 * macros to account for that.
 */
#undef EFC_REGS
#define EFC_REGS HEFC_REGS

#define EEFC_FCR HEFC_FCR
#define EEFC_FRR HEFC_FRR
#define EEFC_FSR HEFC_FSR

#define EEFC_FCR_FARG HEFC_FCR_FARG
#define EEFC_FCR_FCMD_CGPB HEFC_FCR_FCMD_CGPB
#define EEFC_FCR_FCMD_GGPB HEFC_FCR_FCMD_GGPB
#define EEFC_FCR_FCMD_SGPB HEFC_FCR_FCMD_SGPB
#define EEFC_FCR_FKEY_PASSWD HEFC_FCR_FKEY_PASSWD
#define EEFC_FSR_FRDY_Msk HEFC_FSR_FRDY_Msk


/*
 This function enables TCM memories
 */
__STATIC_INLINE void __attribute__((optimize("-O1"))) TCM_Enable(void)
{
    __DSB();
    __ISB();
    SCB->ITCMCR = (SCB_ITCMCR_EN_Msk  | SCB_ITCMCR_RMW_Msk
                    | SCB_ITCMCR_RETEN_Msk);
    SCB->DTCMCR = (SCB_DTCMCR_EN_Msk | SCB_DTCMCR_RMW_Msk
                    | SCB_DTCMCR_RETEN_Msk);
    __DSB();
    __ISB();
}

/** \brief  TCM memory Disable

 This function disables TCM memories
 */
__STATIC_INLINE void __attribute__((optimize("-O1"))) TCM_Disable(void)
{

    __DSB();
    __ISB();
    SCB->ITCMCR &= ~(uint32_t)SCB_ITCMCR_EN_Msk;
    SCB->DTCMCR &= ~(uint32_t)SCB_ITCMCR_EN_Msk;
    __DSB();
    __ISB();
}


/* helper routines to read and write regions of memory in 128 byte chunks */

#define TRANSFER_CHUNK_SIZE 0x80

__STATIC_INLINE void Read_Chunk(uint32_t address)
{
    __asm__ volatile (
         "MOV      r8, %[addr]\n"
         "PLD      [r8, #0xC0]\n"
         "VLDM     r8,{d0-d15}\n"
           : : [addr] "l" (address) : "r8"
    );
}

__STATIC_INLINE void Write_Chunk(uint32_t address)
{
    __asm__ volatile (
         "MOV      r8, %[addr]\n"
         "VSTM     r8,{d0-d15}\n"
           : : [addr] "l" (address) : "r8"
    );
}

/* initialize the ECC for a single TCM region (defined by addr and size) in 128 byte chunks */
static void  __attribute__((optimize("-O1")))  TCM_EccInitOne(uint32_t addr, uint32_t size) {

    uint32_t pTcm;

    for (pTcm = addr; pTcm < (addr + size); pTcm += TRANSFER_CHUNK_SIZE)
    {
        /* read ECC OFF */
        TCMECC_REGS->TCMECC_CR = 0x0;
        __DSB();
        __ISB();
        Read_Chunk(pTcm);

        /* Write ECC ON */
        TCMECC_REGS->TCMECC_CR = 0x1;
        __DSB();
        __ISB();
        Write_Chunk(pTcm);
        __DSB();
        __ISB();
    }
}

/* Initialize ECC for TCM memories */
__STATIC_INLINE void  __attribute__((optimize("-O1"))) TCM_EccInitialize()
{

    __DSB();
    __ISB();

    TCMECC_REGS->TCMECC_CR = 0x0;
    __DSB();
    __ISB();
    SCB->ITCMCR = (SCB_ITCMCR_EN_Msk);
    SCB->DTCMCR = (SCB_DTCMCR_EN_Msk);
    __DSB();
    __ISB();

    /* enable Icache and Dcache */
    SCB_EnableICache();
    SCB_EnableDCache();



    /*  initalize both TCM's (to handle ECC properly prior activating RMW/RETEN features) */
    TCM_EccInitOne(ITCM_ADDR, ITCM_SIZE);
    TCM_EccInitOne(DTCM_ADDR, DTCM_SIZE);

    /* disable cache I et data D */
    SCB_DisableICache();
    SCB_DisableDCache();

    __DSB();
    __ISB();

    TCMECC_REGS->TCMECC_CR = 0x0;

    /*---------------------------------------------------------------------- */
    /* ITCM/DTCM enable with RMW and RETEN + TCMECC ON */
    SCB->ITCMCR = (SCB_ITCMCR_EN_Msk | SCB_ITCMCR_RMW_Msk | SCB_ITCMCR_RETEN_Msk);
    SCB->DTCMCR = (SCB_DTCMCR_EN_Msk | SCB_DTCMCR_RMW_Msk | SCB_DTCMCR_RETEN_Msk);
    __DSB();
    __ISB();

    TCMECC_REGS->TCMECC_CR = 0x1;
    __DSB();
    __ISB();
}

__STATIC_INLINE void  __attribute__((optimize("-O1"))) FlexRAM_EccInitialize(void)
{
    uint32_t pFlexRam;

    __DSB();
    __ISB();

    /* FlexRAM initialization loop (to handle ECC properly) */
    for (pFlexRam = FLEXRAM_ADDR ; pFlexRam < (FLEXRAM_ADDR + FlexRAM_SIZE) ; pFlexRam += TRANSFER_CHUNK_SIZE)
    {
        Read_Chunk(pFlexRam);
        __DSB();
        __ISB();
        Write_Chunk(pFlexRam);
        __DSB();
        __ISB();
    }


    __DSB();
    __ISB();
}

/* Initialize segments */
extern uint32_t __svectors;
extern uint32_t _stack;
extern uint32_t _dinit_size;
extern uint32_t _dinit_addr;

/** \cond DOXYGEN_SHOULD_SKIP_THIS */
/* We pass (0, NULL) for the arguments just in case, but applications
 * are expected to use main(void) as their prototype.  Thus, passing
 * NULL for argv is valid.
 */
extern int main(int, char **);
/** \endcond */

extern void __attribute__((long_call)) __libc_init_array(void);

